tap 'homebrew/bundle'
tap 'homebrew/core'

brew 'autojump'
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'go'
brew 'gti'
brew 'jq'
brew 'nvim'
brew 'shellcheck'
brew 'wget'
brew 'yq'
brew 'watch'
brew 'tmux'

cask 'flycut'
cask 'iterm2'

tap 'neovim/neovim'
brew 'neovim'
# implicit dependency of neovim
brew 'cmake'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

