tap 'homebrew/bundle'
tap 'homebrew/core'

brew 'ag'
brew 'autojump'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'fd'
brew 'gdb'
brew 'gh'
brew 'git-crypt'
brew 'go'
brew 'gpg'
brew 'gti'
brew 'hg'
brew 'jq'
brew 'lastpass-cli'
brew 'npm'
brew 'nvim'
brew 'ripgrep'
brew 'shellcheck'
brew 'sshuttle'
brew 'terraform'
brew 'wget'
brew 'yq'
brew 'watch'
brew 'tmux'
brew 'postgresql'

cask '1password-cli'
cask 'docker'
cask 'flycut'
cask 'gpg-suite'
cask 'iterm2'
cask 'postman'
cask 'virtualbox'
cask 'vagrant'

tap 'heroku/brew'
brew 'heroku'

tap 'git-duet/tap'
brew 'git-duet'

tap 'neovim/neovim'
brew 'neovim'
# implicit dependency of neovim
brew 'cmake'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'heroku/brew'
brew 'heroku'


