tap 'homebrew/bundle'
tap 'homebrew/core'

brew 'ag'
brew 'autojump'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'gdb'
brew 'git-crypt'
brew 'go'
brew 'gpg'
brew 'gti'
brew 'hg'
brew 'jq'
brew 'lastpass-cli'
brew 'nvim'
brew 'shellcheck'
brew 'sshuttle'
brew 'terraform'
brew 'vim'
brew 'wget'
brew 'yq'
brew 'watch'
brew 'tmux'

tap 'caskroom/cask'
cask 'atom'
cask 'docker'
cask 'flycut'
cask 'gpg-suite'
cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'visual-studio-code'
cask 'shiftit'
cask 'zoomus'

tap 'git-duet/tap'
brew 'git-duet'

tap 'neovim/neovim'
brew 'neovim'
# implicit dependency of neovim
brew 'cmake'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

